% Date: 2020/2/29
% Author: TAN Yueyin
% Question:
% 某国有三种股票 A,B,C 在近 12 年的价格（包括分红在内）每年的增长情况见表1. 5（表中同时给出了相应年份 A,B,C 所在证券市场的几百种股票的股票指数增长情况）
% 例如，表中第一个数据1.300的含义是股票A在第一年末的价值是年初价值的1.300倍，这时的收益率为30%，其余数据依此类推． 
% 假设在2013年初有一笔资金准备投资这三种股票，井期望年收益率至少达到15% ，那么应当如何投资？当期望的年收益率变化时，投资组合和相应的风险会如何变化？
% TO (在收益率定为0.15时 最小化风险值，即方差)
% min_x D(R) = X' * V * X 其中V是协方差阵
% s.t.
%     x1 * E(R1) + x2 * E(R2) + x3 * E(R3) = 0.15
%     x1 + x2 + x3 = 1
%     X = (x1, x2, x3)' ge 0 (xi代表购入i种股票的比例)
% i.e.
%     A * X ge 0.15
%     Aeq * X = 1
%% 求协方差阵V
A = [1.300 1.103 1.216 0.954 0.929 1.056 1.038 1.089 1.090 1.083 1.035 1.176];
B = [1.225 1.290 1.216 0.728 1.144 1.107 1.321 1.305 1.195 1.390 0.928 1.715];
C = [1.149 1.260 1.419 0.922 1.169 0.965 1.133 1.732 1.021 1.131 1.006 1.908];
D = [1.258997 1.197526 1.364361 0.919287 1.05708 1.055012 1.187925 1.31713 1.240164 1.183675 0.990108 1.526236];
A1 = A - 1; B1 = B - 1; C1 = C - 1; D1 = D - 1;
ER1 = mean(A1); ER2 = mean(B1); ER3 = mean(C1); ER4 = mean(D1);
DR12 = cov(A1,B1), DR13 = cov(A1,C1), DR23 = cov(B1,C1)
s = var(D1), s1 = var(A1); s2 = var(B1); s3 = var(C1);
V = zeros(3);
V(1:2,1:2) = DR12;
V(2:3,2:3) = DR23;
V(3,1) = DR13(2,1);
V(1,3) = DR13(1,2);%这是观察得到的 WHY?

%% 非线性规划问题
x0 = [1/3 1/3 1/3]';
ER = 0.15;
Aeq = [ER1 ER2 ER3; 1 1 1];
beq = [ER , 1]';
lb = zeros(3,1);
ub = ones(3,1);
options = optimset('largescale','on');
[x,fval,exitflag, output] = fmincon('ch1_1_4_investment_a',x0,[],[],Aeq,beq,lb,ub,[],options)



