% Date: 2020/3/1
% Author: TAN Yueyin
% Question:同ch1_1_4a 但考虑股票指数而不是单只股票的变化
% TO (在收益率定为0.15时 最小化风险值，即方差)
% min f = sum(ai^2 * s0^2 *xi^2 + si^2 * xi^2) 
% s.t.
%     sum(xi * (ai * m + bi)) = 0.15
%     x1 + x2 + x3 = 1 
%     X = (x1, x2, x3)' ge 0 (xi代表购入i种股票的比例)
% i.e.
%     A * X ge 0.15
%     Aeq * X = 1
%% 线性回归得到三个股票的收益率和指数线性关系（这种关系是题目假定的）的回归系数
A = [1.300 1.103 1.216 0.954 0.929 1.056 1.038 1.089 1.090 1.083 1.035 1.176];
B = [1.225 1.290 1.216 0.728 1.144 1.107 1.321 1.305 1.195 1.390 0.928 1.715];
C = [1.149 1.260 1.419 0.922 1.169 0.965 1.133 1.732 1.021 1.131 1.006 1.908];
D = [1.258997 1.197526 1.364361 0.919287 1.05708 1.055012 1.187925 1.31713 1.240164 1.183675 0.990108 1.526236];
A1 = A - 1; B1 = B - 1; C1 = C - 1; D1 = D - 1;
p1 = polyfit(D1, A1, 1); a1 = p1(1); b1 = p1(2);%p = polyfit(x,y,n)表示n阶拟合x, y, p为多项式系数向量
p2 = polyfit(D1, B1, 1); a2 = p2(1); b2 = p2(2);
p3 = polyfit(D1, C1, 1); a3 = p3(1); b3 = p3(2);
%% 求回归方差
s0 = var(D1);
s1 = var(A1 - (a1 * D1 + b1));
s2 = var(B1 - (a2 * D1 + b2));
s3 = var(C1 - (a3 * D1 + b3));

%% 非线性规划问题
ER = 0.15;
m = mean(D1);
x0 = 1/3 * ones(3,1);
Aeq = [1 1 1; a1 * m + b1, a2 * m + b2, a3 * m + b3];
beq = [1, ER]';
lb = zeros(3,1);
ub = ones(3,1);
options = optimset('largescale','on');
[x,fval,exitflag, output] = fmincon('ch1_1_4_investment_d',x0,[],[],Aeq,beq,lb,ub,[],options)